package test;

public class Demo5 {
/*
 * 需求：在控制台输出所有的”水仙花数”
    * 所谓的水仙花数是指一个三位数，其各位数字的立方和等于该数本身。
    * 举例：153就是一个水仙花数。百位的立方和加上10位的立方和加上个位的立方和
    * 153 = 1*1*1 + 5*5*5 + 3*3*3 = 1 + 125 + 27 = 153
 */
/*
 * 分析:
 * 1:100~999
 * 2:获取每一个位数的值,百位十位个位
 * 3:判断各个位置上的立方和是否等于这个数,如果等于打印
 */
    public static void main(String[] args) {
        for (int i = 100; i <= 999; i++) {
            int ge = i % 10; // 153 % 10是3
            int shi = i / 10 % 10; // 153/10等于15.3其实就是15整数运算结果是整数再%10就5
            int bai = i / 10 / 10;
            if (ge * ge * ge + shi * shi * shi + bai * bai * bai == i) {
                System.out.println(i);
            }
        }

    }

}
